Repository: mozilla-l10n/mt-training-data
Catalog: azz/azz_pontoon.tmx
Source language: en_us
Languages: azz

source: See something that isn’t working? Let us know.
azz: ¿Xa tikonita tensa tein amo tekiti? Xitechonili

source: See what makes us different
azz: Xikonita keyej tejuan titataman kemej oksekin

source: Select country
azz: Xikonixpejpena se ueyialtepet

source: Send Firefox to your phone<br> and unleash your Internet.
azz: Xikonpanoltili moteléfono Firefox <br> uan xikonajchiuili moInternet teposcadenas.

source: September
azz: Metsti septiembre

source: Set the Web free and your mind will follow.
azz: Xikonpaleui web tein tatojtomal uan motenemilil kitojtokas

source: Shake off tracking weight
azz: Xionmoijkuanili akin tetoktiliaj akin tel etikej

source: Share
azz: Maj se kipanoltilis okse

source: Share the video
azz: Xikonpanoltili okse video

source: Sharing is caring, but that should be your call. Firefox Private Browsing automatically erases your online info like passwords, cookies and history from your computer. So that when you close out, you leave no trace.
azz: Ijkuak se kinpanoltilis oksekin tensa monekiskia se motachilis, sayoj ke nejin moneki yeski motaixpejpenalis. Firefox Private Browsing ipa kichipaua motajkuilolixneskayouan tein moajsij itech Internet, kemej ichtakatajkuilolmej, cookies uan historial itech motepos. Ijkuin, ijkuak titatsakuas, amo mokauas motaksalis tein oksekin uelis kitojtiliskej.

source: Sign in to your account and we’ll sync the bookmarks, passwords and other great things you’ve saved to Firefox on other devices.
azz: Xionkalakteua itech mocuenta uan tikchiuaskej maj mosenixpatatiyajkan neskayomej marcadores, ichtaktajkuilolmej uan oksekin taman tein semi kualtsin tein tikoneuani itech oksekin teposmej.

source: Sign me up
azz: ¡Nimoijkuiloua!

source: Sign up now
azz: Axkan xionmoijkuilo

source: Sign Up Now
azz: Axkan xionmoijkuilo

source: Skip this step
azz: Amo xikonchiua nejin

source: skip to Navigation
azz: Xikonkalaki kampa se uelis kitatekiujtis Internet

source: Software and other innovations designed to advance our mission.
azz: Software uan oksekin taman tein yankuikej tein kichijchiujkej tein ika okachi tikchiuaskej totekiuj.

source: Some websites and ads attach hidden trackers that collect your browsing info long after you’ve left. Only Firefox Private Browsing has tracking protection to block them automatically.
azz: Sekin sitios web uan tanauatilmej kitaliaj tein teichtakatoktiliaj uan ijkon kinechikouaj tein moaxka itech Intenet satepan tionkisas. Sayoj Firefox Private Browsing san yualitonal kiyekpixtinemi maj amo akin kiita toni se kiitstinemi Internetkopa uan ipa kiajchiuilis.

source: <span>Firefox</span> + You
azz: <span>Firefox</span> + Tejuatsin

source: Speak up
azz: Xionchikaujkatajto

source: Speed up your computer
azz: Xikonkaua maj telijsiujka tekiti motepos

source: Stand Up For Encryption
azz: Xionmeua uan Xiontajkuilo ika tapoualmej tein se amo uelis kiajsikamatis

source: Start faster, tab hop quicker, get more done.
azz: Okachi ijsiujka xionpeua, okachi ijsiujka xipano pestaña, okachi xikonchiua tensa.

source: Start now
azz: Axkan xionpeua

source: Start sharing
azz: Xionpeua xikonpanoltili okse tensa

source: Stop running out of memory
azz: Amo xikonauilo taelnamikilis

source: Storage panel
azz: Taixnextiloni tein nechikolis

source: Style Editor
azz: Manamik tein kipata estilos

source: Subscribe to monthly updates and keep current with Mozilla news, including the latest tips and tricks for getting the most out of your Firefox browser. It’s the perfect way for us to keep in touch!
azz: Xionmoijkuilo uan ijkon tionuelis mejmetstika tikonselis tayankuililis uan tikonixmatis tein yankuik tein kipias Firefox, uan no taixpetanilis uan tayolmajxitilis uan ijkon tionuelis okachi kuali tkontekitiltis monavegador. ¡Ijkuin kuali titechonixmatis!

source: Support
azz: Kampa tepaleuiaj

source: switch language
azz: Kampa se kipatas tajtolis

source: Sync between devices
azz: Xikontekitilti Sync ika moteposuan

source: Tabs that travel
azz: Tel uejka xionyo uan xikonuika mopestañajuan

source: Take a browse on the wild side.
azz: Xiontachiati sekan tein kuoujtajkayot

source: Take control of your browser
azz: Xikonyekana monavegador

source: Take our latest experimental features for a spin and shape the future of Firefox.
azz: Xikonixejeko tonepaleuiluan tein yankuikej uan xikonchijchiua Firefox tein satepan ualas

source: Take your favorites on the fly. Use Firefox Sync to access your bookmarks across all your devices, from desktop to mobile. Or try <a href="%(url)s">Pocket</a> to save any online article, or page and come back to later – even without internet.
azz: Xikonkui tein tikonteluelita ijkuak tikonnekis. Xikontatekiujti Firefox Sync uan xionkalakis kampa moneskayouan marcadores itech nochin moteposuan, kemej tein tajkuilouapal oso tein se uelis mouikas. Oso xikontatekiujti <a href="%(url)s">Pocket</a> uan ijkon tikoneuas tein yeski tamachtilis tein moajsi itech Internet, oso página web uan satepan tionuelis tionmokepas, maski amo ika Internet.

source: Teach The Web
azz: Maj se kinmachti Web oksekin

source: Test about-to-be-released features in the most stable pre-release build.
azz: Xiontachijchiua, xiontaixejeko uan xiontaiskalti uan okachiok, tein ika sesaj navegador tein aksamej kinchiuilijkej webchijchiuanij.

source: Test beta versions of Firefox for iOS via Apple’s TestFlight program.
azz: Xikonixejeko versiones Firefox tein beta ika iOS itechkopa programa TestFlight tein kichiuak Apple.

source: Test beta versions of Firefox for iOS via Apple’s TestFlight program and help make our mobile browser for iPhone, iPad and iPod touch even better.
azz: Xikonixejeko versiones Firefox tein beta ika iOS itechkopa programa TestFlight tein kichiuak Apple uan xitechonpaleui tiyektaliskej tonavegador tein se uelis kiuika kampa yeski ika iPhone, iPad uan iPod touch.

source: Test brand new features daily (or… nightly). Enjoy at your own risk.
azz: Mojmostaj xikonixejeko yankuikej nepaleuilmej (oso… nochin tayouayan). Xionixmatati uan xionmopakilti.

source: Test sites on emulated devices in your browser.
azz: Xikonixejeko sitios itechkpa teposmej tein kichiujkej kemej oksekin tein moajsij itech monavegador.

source: Text
azz: Tajkuilol

source: Thanks!
azz: ¡Tasojkamatik!

source: Thanks for choosing Firefox!
azz: ¡Timitsontasojkamatiliaj tikonixpejpenak Firefox!

source: That shopping rabbit hole you started on your laptop this morning? Pick up where you left off on your phone tonight. That dinner recipe you discovered at lunchtime? Open it on your kitchen tablet, instantly. Connect your personal devices, securely.
azz: ¿Xa nejin amo tikontamikouak itechkopa motepos kualkan? Xikonkuepa youak itechkopa moteléfono. ¿Nejon takualchiualis tein kualtias tiotak takualis tein tikonajsik keman tionyajki tionalmasaloto? Nimantsin xikontapo itech motableta ijkuak tiyetos kaltakualchiualoyan. Xikonnajnamikti moteposuan tein tikontatekiujtijtinemi ika nochi yekyetolis.

source: Themes
azz: Tein moitas

source: The only developer tool for inspecting the Web Audio API.
azz: Yejua sesaj manamik tein ika tionuelis tikonchiuas tensa uan ijkon tikonitas API tein kipia Kakistilyot tein Web.

source: The speed you need. The privacy you trust.
azz: Ijsiujkayot tein moneki. Keniuj kiyekpiaj tein kiseliaj tein ika tionuelis tikontakuajtamatis.

source: Tips for filing a bug
azz: Tayolmajxitilis tein mitsonpaleuis tikontenextis se nepolol

source: Tour
azz: Paxalolis

source: Track CSS, JavaScript, security and network issues.
azz: Xikontemo kuejmolmej tein moajsij itech CSS, JavaScript, yekyetolis uan matat.

source: Try New Browser Features in Pre-Release Versions | Firefox
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia navegador tein ika versiones acho release | Firefox

source: Try New Features in a Pre-Release Android Browser | Firefox
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia se navegador Android achto ke nochin uelis kitatekiujtis | Firefox

source: Try New Features in a Pre-Release iOS Browser | Firefox
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia se navegador iOS achto ke nochin uelis kitatekiujtis | Firefox

source: Try the latest Android features, before they get released to the rest of the world.
azz: Xikonixejeko inepaleuiluan Android tein okachi yankuikej, achto taltikpakneminij uelis kichiuaskej.

source: Try the Lean Data Toolkit
azz: Xikonixejeko Lean Data Toolkit

source: Unblock bottlenecks, streamline processes, optimize assets.
azz: Xikonajchiua tein amo kikaua maj yektekiti uan tein kiiliaj lometajkechmej, xikonijsiuilti ojtokaltilismej, okachi kuali xikonkui tein onkak.

source: Unleash your Internet
azz: Xikontojtoma moInternet

source: Update now
azz: Maj axkan moyankuili

source: Update your Firefox
azz: Xikonyankuili moFirefox

source: Upgrade now
azz: Maj axkan moyankuili

source: Use Bookmarks, Tabs and Passwords Across Devices | Firefox
azz: Xiontatekiujti neskayomej marcadores, pestañas uan ichtakatajkuilolmej itech dispositivos | Firefox

source: Use Firefox everywhere
azz: Xikontatekiujti Firefox kampa yeski

source: Use less memory
azz: Kikui amo okachi taelnamikilis

source: Using the web as the platform, we build open, innovative technologies that allow developers to work free of closed, corporate ecosystems and create faster, safer web experiences for us all.
azz: Tiktatekiujtiaj web kemej yeskia se plataforma uan ijkon tikchijchiuaj teposmej tein tatapotokej uan yankuikej maj kinpaleuikan webchijchiuanij tekitiskej uan amo moajsiskej youaloyan tein tatsak uan tein kipouij uejueyitekitiloyamej, uan no kinpaleuikan kichijchiuaskej sitios web tein okachi ijsiujkatekitij uan tinochin tikinitaskej semi yekyetokej.

source: View Full Site
azz: Maj se kiita nochi sitio

source: View open tabs on any device.
azz: Xikonita pestañas tapotokej itech tein yeski tepos.

source: Virtual Reality Platform
azz: Plataforma tein ika Mochiujtok tein Virtual

source: Visit support.mozilla.org
azz: Xikonkalpano support.mozilla.org

source: Visual Editing
azz: Patalis tein kiiliaj edición tein se uelis kiitas

source: Watch the video
azz: Xikonita video

source: Web Audio
azz: Kakistilyot tein Web

source: We believe the Internet is for people, not profit. Unlike other companies, we don’t sell access to your data. <em>You’re</em> in control over who sees your search and browsing history. Choice — that’s what a healthy Internet is all about!
azz: Tikneltokaj Internet kichijchiujkej maj kitatekiujtikan tokniuan, amo maj motomintikan sekin. Tejuan tataman kemej oksekin tekitiloyamej, amo tiknamakaj maj kalakikan itech motajkuilolixnekayouan. <em>Tejuatsin</em> tikonyekana akoni uelis kiitas mohistorial tein kinextia motatemolisuan uan nochi tikonitstinemik. ¡Taixpejpenalis — nejin yejua nochi monekiskia kipias se paktok Internet!

source: Web Innovations
azz: Tein okachi yankuikej itech Web

source: WebM format
azz: Formato WebM

source: We don’t sell access to your online data. Period.
azz: Amo tiknamakaj maj kalakikan itech motajkuilolixnekayouan tein moajsij Internet. Tonalmej.

source: We help keep corporate powers in check.
azz: Tikpaleuijtokej motsinkixtiaj ininchikaujkauelilis uejueyitekitiloyamej.

source: Welcome to Firefox
azz: Kuali ke tikontapoj Firefox

source: We led the tech to run 3D games at near-native speeds, and now Firefox is bringing better performance to online gaming. Our powerful browser reduces lags, speeds up ping times and optimizes overall gameplay through faster, leaner browsing.
azz: Tikchiuaj teposmej maj kitekitiltiaj auilmej 3D ika ijsiujkayomej kemej yeskia yekinika, uan axkan Firefox kichiua maj kuali tekitikan auilmej Internetkopa. Tonavegador tein semi kichauak amo okachi uejkaua, kiijsiuiltia tein uejkaua ping uan nochin auilmej kichiua maj kuali tekitij ijkuak se kitatekiujtia Internet okachi ijsiujka uan ejkaujtik.

source: We’re always transparent.
azz: Tejuan nochipa tinaltoktik

source: We’re obsessed with protecting your privacy. That’s why we’ve made Firefox Private Browsing more powerful than the others.
azz: Nochipa tiknemilijtinemij keniuj kuali timitsonyekpialiskej tein titechonseliltis. Yejua ika tikchijchiujkej Firefox Private Browsing okachi chikauak uan amo oksekin.

source: We’ve been working out, so you can get more done.
azz: Titekitinij uan ijkón tionuelis okachi taman kichiuas.

source: We will only send you Mozilla-related information.
azz: Sayoj timitsontitaniliskej tanauatil tein mouika iuan Mozilla.

source: What you see is what you get
azz: Nejin tikonitstok, nejin tikonpixtok

source: Whoops!
azz: ¡Maj timopiakan!

source: Whoops! Be sure to enter a valid email address.
azz: ¡Maj timopiakan! Xikonyekita tikonijkuilos se correo itech tepos tein kualtia.

source: Working at the grassroots and policy levels, we teach web literacy, provide tools and advocate on behalf of every individual who values an internet built on fairness, inclusion and respect.
azz: Titekitij ika tatsineualoni uan tanemililis, tiktenextiaj webtaixmatilis, tikmakaj manamikmej uan tikintajtolpaleuiaj sejsemej tokniuan akin kipatiuitaj maj Internet kitayekanaltis melaujkayot, amo nechichikolyot uan poujkaitalis.

source: Working to keep the Internet healthy, open and accessible to all, we teach web literacy, provide tools and advocate on behalf of every individual who values the Internet as a global public resource.
azz: Titekitij maj Internet pakkayoyeto, tatapotok uan nochin tokniuan uelis kitatekiujtiskej, tiktenextiaj webtaixmatilis, tikmakaj manamikmej uan tikintajtolpaleuiaj sejsemej tokniuan akin kipatiuitaj maj Internet yeski kemej tein uelis kikuiskej semanauak taltikpak.

source: Your download was interrupted
azz: Amo kitamitemouij

source: You’re in control with Firefox’s easy-to-use features that protect your privacy and browsing speeds.
azz: Tiontayekantok ika nepaleuijlmej tein kipia Firefox tein amo ouij tikontatekiujtis uan kipaleuiaj maj mitsonyekpialikan tein Internetkopa kiseliskej uan kichiuaj Internet maj okachi ijsiujka tekiti.

source: YOUR EMAIL HERE
azz: NIKAN MOCORREO ITECH TEPOS

source: You’re using a pre-release version of Firefox.
azz: Tikontatekiujtijtok se versión Firefox tein achto release.

source: Your favorite add-ons and extensions
azz: Motamajsikayouan uan moextensiónuan tein tikonteluelita

source: Your Firefox Account is the doorway to all your web stuff—we help you keep it safe. Your data is always in your control, unreadable by anyone else, and encrypted with your account password. We protect it and hand you the key.
azz: Mocuenta Firefox kemej yeskia ikalakyampa nochi tein tikonitstos itech web, timitsonpaleuiaj maj nochi yekyetokan. Nochi tein moaxka tikonyekanas, amo akin uelis kiixtajtoltis uan nochi tiktaliskej kemej amo akin uelis kiajsikamatis itechkopa iichtakatajuilol mocuenta. Tikmatampauiskej uan timitsonmakaskej itepostatapoloni.

source: Your Firefox is up to date.
azz: Senkis kiyankuilijkejya moFirefox

source: About { -brand-name-mozilla }
azz: Xikonixmati { -brand-name-mozilla }

source: <a href="{ $url }">{ -brand-name-chrome } uses up to 1.77x more memory than { -brand-name-firefox }</a>. If your computer is already low on memory, this can cause a significant slowdown. Using { -brand-name-firefox }’s latest version with multi-process can result in more available memory to run your favorite programs.
azz: <a href="{ $url }"> { -brand-name-chrome } kikui kemej 1.77 okachi taelnamikilis uan amo { -brand-name-firefox } </a>. Komo motepos kipia ya amo miak taelnamikilis, nejon uelis kichiuas maj yolik tekiti. Komo tikontatekiujtis { -brand-name-firefox } tein yankuik uan ika tekiti tel miak ojtokaltilismej, uelis mokauas taelnamikilis tein tionuelis tikonkuis ika programas tein tikonteluelitstinemi.

source: <a href="{ $url }">{ -brand-name-mozilla } no longer provides security updates for { -brand-name-firefox } on { -brand-name-windows } { -brand-name-xp } or { -brand-name-vista }</a>, but you can still download the final { -brand-name-windows } 32-bit version below.
azz: <a href="{ $url }">{ -brand-name-mozilla } amo kitemakasya yankuikej versiones tein yekyetokej ika { -brand-name-firefox } itech { -brand-name-windows } { -brand-name-xp } oso { -brand-name-vista }</a>, sayoj ke xa uelis tiktemos itamian version { -brand-name-windows } ika 32-bits satepan.

source: Already using { -brand-name-firefox }?
azz: ¿Tikontatekiujtijtokya { -brand-name-firefox }?

source: An error occurred in our system. Please try again later.
azz: Mochiuak se nepolol itech tosistema. Ika kualtakayot, oksepa xiontachijchiua satepan.

source: <a rel="external" href="{ $feedback }">Give us feedback</a> to help us put the final tweaks on performance and functionality in a stable environment.
azz: <a rel="external" href="{ $feedback }">Xitechonpanoltili motanemililuan</a> maj titechonpaleui tiktamiyektaliskej keniuj taki totachiualisuan uan nepaleuilmej kampa amo mopatatok.

source: Be among the first to explore future releases of { -brand-name-firefox } for desktop, { -brand-name-android } and { -brand-name-ios }.
azz: Xionmoachtoui uan xikontatekiujti versiones { -brand-name-firefox } tein satepan ualas ika tepos tein tajkuiloluapal, { -brand-name-android } uan { -brand-name-ios }.

source: { -brand-name-firefox }, a different browser for different times. Browse free.
azz: { -brand-name-firefox }, se tataman navegador itech tataman tonalmej. Xiontatekiujti Internet uan amo moneki tiontaxtauas.

source: { -brand-name-firefox-beta } automatically sends feedback to { -brand-name-mozilla }.
azz: Firefox tein Beta iselti san kititanilia { -brand-name-mozilla } tanemililmej.

source: { -brand-name-firefox-browser }: Better bookmarks everywhere you go
azz: Navegador Firefox: kipia tein okachi kuali nexkayomej marcadores kampa yeski tionyouej

source: { -brand-name-firefox-browser }: Fast, Easy Password Manager
azz: Navegador Firefox: tein ika se ijsiujka uan amo ouij kiixyekanas ichtakatajkuilolmej

source: { -brand-name-firefox-browser }: Use less memory, get more speed
azz: Navegador Firefox: kikui amo okachi taelnamikilis, kipia okachi ijsiujkayot

source: { -brand-name-firefox-developer-edition } automatically sends feedback to { -brand-name-mozilla }.
azz: { -brand-name-firefox-developer-edition } iselti uan nimantsin kipanoltilia taman { -brand-name-mozilla } uan ijkón no uelis kipias.

source: { -brand-name-firefox } for Other Platforms & Languages
azz: { -brand-name-firefox } tein tionuelis tikontatekiujtis ika oksekin plataformas uan tepostajtolismej

source: { -brand-name-firefox } is a browser with a conscience. As part of the technology non-profit { -brand-name-mozilla }, we fight for your online rights, keep corporate powers in check and help educate developing countries on healthy Internet practices. So when you choose { -brand-name-firefox }, we’re choosing you, too.
azz: { -brand-name-firefox } se navegador tein kipia itanemilil. Tejuan pouij iteposuan { -brand-name-mozilla } tein amo kitemoua motomintis, timochikauaj momelaujkatanauatiluan itech Internet, tiktsinkixtiaj ichikaujkauelilis uejueyitekitiloyamej uan no tikinmachtiaj ueyialtepemej kampa kipanouaj tatasojtilis kemej kitatekiujtiskej Internet tein paktok. Yejua ika, komo tikonixpejpenas { -brand-name-firefox }, no timitsonixpejpenaskej.

source: { -brand-name-firefox } is independent and a part of the non-profit { -brand-name-mozilla }, which fights for your online rights, keeps corporate powers in check and makes the Internet accessible to everyone, everywhere.
azz: { -brand-name-firefox } amo kitamakati akin okachi uejueyichiuanimej uan poui { -brand-name-mozilla } tein amo kitemoua motomintis, mochikaua maj nochin tokniuan kipia ininmelaujkatanauatiluan itech Internet, kitsinkixtia ichikaujkauelilis uejueyitekitiloyamej uan no kichiua nochimej uelis kalakiskej Internet, kampa yeski.

source: { -brand-name-firefox } is now faster and leaner
azz: Axkan { -brand-name-firefox } okachi ijsiuik uan ejkaujtik

source: { -brand-name-firefox }: More protection. Less worry.
azz: { -brand-name-firefox }: Okachi tematampauilis. Amo okachi kuejmololis.

source: { -brand-name-firefox-nightly } automatically sends feedback to { -brand-name-mozilla }.
azz: { -brand-name-firefox-nightly } iselti san kipanoltilia { -brand-name-mozilla } tanemililmej.

source: { -brand-name-firefox } Password Manager saves all your passwords in one place so you can automatically login to sites, or retrieve saved passwords.
azz: Inepaleuil { -brand-name-firefox } tein itokay Password Manager kieua nochin moichtakatajkuiloluan sayoj sekosaj uan ijkon tionuelis ijsiujka tionkalakteuas itech sitios oso tikonajsis ichtakatajkuilolmej tein achto tikoneuak.

source: { -brand-name-firefox } Privacy
azz: Keniuj { -brand-name-firefox } kiyekpia tein kiselia

source: { -brand-name-firefox } protects your online privacy and blocks trackers that follow you around the web.
azz: { -brand-name-firefox } kuali mitsonyekpilia tein tikonseliltis Internetkopa uan amo kikaua maj tekitikan tein mitsontoktiliaj itech web.

source: { -brand-name-firefox }: Rebel with a cause
azz: Taixnamikkej tein kipia keyej

source: { -brand-name-nightly } Blog
azz: Tepostanojnots blog tein poui { -brand-name-nightly }

source: { -brand-name-send } { -brand-name-firefox } to your phone<br> and unleash your Internet.
azz: Xikonpanoltili moteléfono { -brand-name-firefox } <br> uan xikonajchiuili moInternet teposcadenas.

source: Check out new { -brand-name-android } features in their earliest stages. Enjoy at your own risk.
azz: Xiontachiati yankuikej nepaleuilmej ika { -brand-name-android } ijkuak peua. Xionixmatati uan xionmopakilti.

source: Check your device for the email!
azz: ¡Xikonita motepos ika correo itech tepos!

source: Check your device for the email or text message!
azz: ¡Xikonita motepos ika correo itech tepos oso SMS!

source: Did you know? { -brand-name-mozilla } — the maker of { -brand-name-firefox } — fights to keep the internet a global public resource, open and accessible to all.
azz: ¿Tikonmattok? { -brand-name-mozilla } — akin kichijchiuak { -brand-name-firefox } — mochikaua nochin uelis kitatekiujtis Internet semanauak taltikpakI, Internet yeski tatapotok uan nion se kitsakuiliskej kikuis.

source: Don’t agonize, lovers of bookmarking. Organize with { -brand-name-firefox }.
azz: Tejuatsin tikontasojta neskayomej marcadores, amo xiontajyoui. Xikonojtokalti ika { -brand-name-firefox }

source: Download and test future releases of { -brand-name-firefox } for desktop, { -brand-name-android } and { -brand-name-ios }.
azz: Xikontemoui uan xikonixejeko oksekin versiones { -brand-name-firefox } tein satepan ualaskej ika tajkuiloluapal, { -brand-name-android } uan { -brand-name-ios }.

source: Download and test the latest { -brand-name-firefox } for { -brand-name-android } features with { -brand-name-aurora }, { -brand-name-beta } and { -brand-name-nightly } builds.
azz: Xikontemoui uan xikonixejeko inepaleuiluan { -brand-name-firefox } tein okachi yankuikej ika { -brand-name-android } tein kipia { -brand-name-aurora }, { -brand-name-beta } uan { -brand-name-nightly }.

source: Download and test the latest { -brand-name-firefox } for desktop features with { -brand-name-developer-edition }, { -brand-name-beta } and { -brand-name-nightly } builds.
azz: Xikontemoui uan xikonixejeko inepaleuiluan { -brand-name-firefox } tein tajkuiloluapal ika { -brand-name-developer-edition }, { -brand-name-beta } uan { -brand-name-nightly }.

source: Download { -brand-name-firefox }
azz: Xikontemoui { -brand-name-firefox }

source: Download { -brand-name-firefox } for { -brand-name-android } and { -brand-name-ios }
azz: Xikontemoui { -brand-name-firefox } ika { -brand-name-android } uan { -brand-name-ios }
